In [20]:
import pandas as pd
import numpy as np


ventas = {
    "Comercial": [ "Juan", "Maria", "Manuel", "Vanesa"],
    "Empresas" : ["Soriana", "Santander", "Radiotaxi", "La Bamba"],
    "Primas" : [3000, 10.000, 3000, 15.000]
                                      }

df=pd.DataFrame(ventas)
df

  Comercial   Empresas  Primas
0      Juan    Soriana  3000.0
1     Maria  Santander    10.0
2    Manuel  Radiotaxi  3000.0
3    Vanesa   La Bamba    15.0

In [4]:

df.groupby("Empresa")

In [15]:
por_empresa= df.groupby("Empresa")

In [22]:
por_empresa.min()

          Comercial  Salario
Empresa
La Bamba     Vanesa     15.0
Radiotaxi    Manuel   3000.0
Santander     Maria     10.0
Soriana        Juan   3000.0

In [25]:
por_empresa.count()

           Comercial  Salario
Empresa
La Bamba           1        1
Radiotaxi          1        1
Santander          1        1
Soriana            1        1

In [26]:
por_empresa.describe()

          Salario
            count    mean std     min     25%     50%     75%     max
Empresa
La Bamba      1.0    15.0 NaN    15.0    15.0    15.0    15.0    15.0
Radiotaxi     1.0  3000.0 NaN  3000.0  3000.0  3000.0  3000.0  3000.0
Santander     1.0    10.0 NaN    10.0    10.0    10.0    10.0    10.0
Soriana       1.0  3000.0 NaN  3000.0  3000.0  3000.0  3000.0  3000.0

In [28]:
por_empresa.describe().transpose()["La Bamba"]

Salario  count     1.0
         mean     15.0
         std       NaN
         min      15.0
         25%      15.0
         50%      15.0
         75%      15.0
         max      15.0
Name: La Bamba, dtype: float64